mm32/mm32_classb_cm0/iec60730b_f0040/Device/MM32F0040/Include/reg_rcc.h
////////////////////////////////////////////////////////////////////////////////
/// @file     reg_rcc.h
/// @author   AE TEAM
/// @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
///           MM32 FIRMWARE LIBRARY.
////////////////////////////////////////////////////////////////////////////////
/// @attention
///
/// THE EXISTING FIRMWARE IS ONLY FOR REFERENCE, WHICH IS DESIGNED TO PROVIDE
/// CUSTOMERS WITH CODING INFORMATION ABOUT THEIR PRODUCTS SO THEY CAN SAVE
/// TIME. THEREFORE, MINDMOTION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
/// CONSEQUENTIAL DAMAGES ABOUT ANY CLAIMS ARISING OUT OF THE CONTENT OF SUCH
/// HARDWARE AND/OR THE USE OF THE CODING INFORMATION CONTAINED HEREIN IN
/// CONNECTION WITH PRODUCTS MADE BY CUSTOMERS.
///
/// <H2><CENTER>&COPY; COPYRIGHT MINDMOTION </CENTER></H2>
////////////////////////////////////////////////////////////////////////////////

// Define to prevent recursive inclusion

#ifndef __REG_RCC_H
#define __REG_RCC_H

// Files includes

#include <stdint.h>
#include <stdbool.h>
#include "types.h"




#if defined ( __CC_ARM )
#pragma anon_unions
#endif








////////////////////////////////////////////////////////////////////////////////
/// @brief RCC Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_BASE                        (AHBPERIPH_BASE + 0x1000)               ///< Base Address: 0x40021000





////////////////////////////////////////////////////////////////////////////////
/// @brief RCC Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct {
    __IO u32 CR;                                                                ///< Control Register                               offset: 0x00
    __IO u32 CFGR;                                                              ///< Configuration Register                         offset: 0x04
    __IO u32 CIR;                                                               ///< Clock Interrupt Register                       offset: 0x08
    __IO u32 APB2RSTR;                                                          ///< Advanced Peripheral Bus 2 Reset Register       offset: 0x0C
    __IO u32 APB1RSTR;                                                          ///< Advanced Peripheral Bus 1 Reset Register       offset: 0x10
    __IO u32 AHBENR;                                                            ///< Advanced High Performance Bus Enable Register  offset: 0x14
    __IO u32 APB2ENR;                                                           ///< Advanced Peripheral Bus 2 Enable Register      offset: 0x18
    __IO u32 APB1ENR;                                                           ///< Advanced Peripheral Bus 1 Enable Register      offset: 0x1C
    __IO u32 RESERVED0x20;                                                      ///< Reserved                                       offset: 0x20
    __IO u32 CSR;                                                               ///< Control Status Register                        offset: 0x24
    __IO u32 AHBRSTR;                                                           ///< Advanced High Performance Bus Reset Register   offset: 0x28
    __IO u32 CFGR2;                                                             ///< Configuration Register 2                       offset: 0x2C
    __IO u32 RESERVED0x30;                                                      ///< Reserved                                       offset: 0x30
    __IO u32 RESERVED0x34;                                                      ///< Reserved                                       offset: 0x34
    __IO u32 RESERVED0x38;                                                      ///< Reserved                                       offset: 0x38
    __IO u32 RESERVED0x3C;                                                      ///< Reserved                                       offset: 0x3C
    __IO u32 SYSCFGR;                                                           ///< System Configuration Register                  offset: 0x40
    __IO u32 HSIDLY;                                                            ///< HSI delay Register                             offset: 0x44
    __IO u32 HSEDLY;                                                            ///< HSE delay Register                             offset: 0x48
    __IO u32 ICSCR;                                                             ///< Internal clock source calibration register     offset: 0x4C
    __IO u32 PLLCFGR;                                                           ///< PLL Configuration Register                     offset: 0x50
    __IO u32 RESERVED[12];                                                      ///< Reserved                                       offset: 0x54
    __IO u32 PLLDLY;                                                            ///< PLL delay Register                             offset: 0x88
} RCC_TypeDef;


////////////////////////////////////////////////////////////////////////////////
/// @brief RCC type pointer Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC                             ((RCC_TypeDef*) RCC_BASE)



////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_CR_HSION_Pos                (0)
#define RCC_CR_HSION                    (0x01U << RCC_CR_HSION_Pos)             ///< Internal High Speed clock enable

#define RCC_CR_HSIRDY_Pos               (1)
#define RCC_CR_HSIRDY                   (0x01U << RCC_CR_HSIRDY_Pos)            ///< Internal High Speed clock ready flag

#define RCC_CR_LPF_BYP_Pos              (4)
#define RCC_CR_LPF_BYP                  (0x01U << RCC_CR_LPF_BYP_Pos)           ///< LPF_IN direct output
#define RCC_CR_LPF_SEL_Pos              (5)
#define RCC_CR_LPF_SEL                  (0x01U << RCC_CR_LPF_SEL_Pos)           ///< Output after LPF filtering
#define RCC_CR_DEGLITCH_BYP_Pos         (6)
#define RCC_CR_DEGLITCH_BYP             (0x01U << RCC_CR_DEGLITCH_BYP_Pos)      ///< Bypass deburring function
#define RCC_CR_DEGLITCH_SEL_Pos         (7)
#define RCC_CR_DEGLITCH_SEL             (0x01U << RCC_CR_DEGLITCH_SEL_Pos)      ///< Deburring width 5nS
#define RCC_CR_HSE_OUTPUTSEL_Pos        (8)
#define RCC_CR_HSE_OUTPUTSEL            (0x01U << RCC_CR_HSE_OUTPUTSEL_Pos)     ///< Filtered output
#define RCC_CR_HSIDIV_Pos               (11)
#define RCC_CR_HSIDIV_1                 (0x00U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 1   factor 
#define RCC_CR_HSIDIV_2                 (0x01U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 2   factor 
#define RCC_CR_HSIDIV_4                 (0x02U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 4   factor 
#define RCC_CR_HSIDIV_8                 (0x03U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 8   factor 
#define RCC_CR_HSIDIV_16                (0x04U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 16  factor 
#define RCC_CR_HSIDIV_32                (0x05U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 32  factor 
#define RCC_CR_HSIDIV_64                (0x06U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 64  factor 
#define RCC_CR_HSIDIV_128               (0x07U << RCC_CR_HSIDIV_Pos)            ///< HSI clock division 128 factor 

